{
    "weather": [
        "天气如何？",
        "现在的天气",
        "今天的天气预报",
        "现在的天气状况",
        "今天天气怎么样",
        "目前是什么天气",
        "今天的天气概述",
        "当前天气状况如何",
        "今天会下雨吗？",
        "今天晴天吗？",
        "今天的天气状况如何",
        "现在外面是什么天气",
        "今天天气好么",
        "今天有没有雾霾",
        "明天有没有大风",
        "今天会不会很冷",
        "今天的天气会变化吗",
        "今天晚上的天气如何",
        "今天夜里会下雨吗",
        "明天会下雨吗？",
        "北京今天的预报",
        "两天后上海的天气情况",
        "现在的温度",
        "现在多少度",
        "外面有多热",
        "明天热不热",
        "现在的气温是多少",
        "今天最高温度是多少",
        "今天最低温度是多少",
        "现在外面感觉冷吗",
        "明天会比今天热吗",
        "明天会比今天冷吗",
        "今天的温度变化大吗",
        "室外的温度是多少",
        "达拉斯今天热不热",
        "苏州现在天气怎么样",
        "how's the weather",
        "What's going on with the weather?",
        "Can you give me an update on the weather?",
        "How's the forecast looking today?",
        "Give me a summary of the current weather.",
        "Can you tell me the current weather?",
        "What is the weather situation at the moment?",
        "Could you provide a quick weather update?",
        "Is it raining or sunny outside?",
        "What's the weather like right now?",
        "Tell me the current weather conditions.",
        "How about the weather today?",
        "What's the weather looking like for the next few hours?",
        "Is it going to stay this way all day?",
        "Could you give me a brief overview of the weather?",
        "What's the general weather situation in our area?",
        "Is it cloudy or clear outside?",
        "What's the forecast saying for today's weather?",
        "Is it going to be a warm day?",
        "Are we expecting any storms today?",
        "What's the weather condition outside my window?",
        "Is it a typical day for this season in terms of weather?",
        "how's the weather now?",
        "What's the temperature like right now?",
        "Can you tell me the current temperature?",
        "How hot is it outside?",
        "What's the temperature supposed to be today?",
        "What is the current temp outside?",
        "Could you tell me the outdoor temperature?",
        "Is it cold or warm outside?",
        "What's the high temperature for today?",
        "What's the low temperature expected tonight?",
        "How does the temperature feel outside?",
        "Is it going to get warmer or cooler today?",
        "What's the temperature in the shade?",
        "Can you provide the current temp in Celsius?",
        "What's the temperature in Fahrenheit right now?",
        "Is it too hot to be outside?",
        "What's the temperature like in the morning?",
        "How about the temperature in the evening?",
        "Is it warm enough to go swimming?",
        "What's the temperature in the city center?",
        "Can you tell me the temp in the nearby area?",
        "Is it below freezing outside?",
        "What's the average temperature for today?",
        "Is the temperature dropping or rising?",
        "What should I wear considering the temperature?"
    ],
    "base64": [
        "请将数据使用base64编码",
        "需要将以下数据base 64编码",
        "请将此字符串转为base 58",
        "将数据转为base58编码",
        "信息base64编码",
        "请帮忙编码base64",
        "将数据编码为base64",
        "base 64编码",
        "base64 在线编码",
        "在线编码 base 64",
        "编码 base64",
        "请解码这个base64数据",
        "有base64编码字符串需要解码",
        "帮忙解码base64",
        "将base 58编码转回原数据",
        "解码base58信息",
        "解码这个base64",
        "将base64转文本",
        "base64解码",
        "base64 解码",
        "base58 在线解码",
        "在线解码 base58",
        "解码 base64",
        "Please encode this data with base64:",
        "I need to encode the following data in base64",
        "Could you encode this string using base64?",
        "Convert this data to b64 encoding",
        "I want to encode this information with base64",
        "Help me encode this in base32",
        "Can you encode this data to base64 format?",
        "b64 encode",
        "base64 encode",
        "encode base64",
        "base 64 encode online"
    ],

    "url-encode": [
        "编码 url",
        "URL部分需要编码",
        "请将URL部分编码",
        "URL编码转换",
        "编码url 段",
        "URL数据编码",
        "请解码这个URL",
        "有 url 编码需要解码",
        "解码这个URL",
        "URL编码转回原URL",
        "解码 URL部分",
        "解码 URL 段",
        "URL 编码转文本",
        "encode URL: ",
        "I need to encode this URL component: ",
        "Convert url encoded",
        "encode this URL for safe transmission",
        "Encode this URL segment: ",
        "decode this url ",
        "convert encoded url to text",
        "url decoder",
        "URL encoder"
    ],

    "html-encode": [
        "请编码HTML实体",
        "文本转为HTML实体",
        "编码为HTML实体",
        "文本HTML实体编码",
        "预防HTML解析编码",
        "HTML实体编码",
        "文本HTML使用编码",
        "html 转义",
        "请解码HTML实体",
        "HTML实体需要解码",
        "解码HTML实体",
        "HTML实体转回文本",
        "HTML实体解码",
        "解码HTML实体",
        "HTML实体转文本",
        "html 实体转义",
        "html实体 转换",
        "html &nbsp 转换",
        "html nbsp 意思",
        "Please encode HTML entities",
        "Convert text to HTML entities",
        "Encode to HTML entities",
        "Encode text HTML entities",
        "Prevent HTML parsing encoding",
        "HTML entity encoding",
        "Text HTML uses encoding",
        "html escape",
        "Please decode HTML entities",
        "HTML entities need to be decoded",
        "Decode HTML entities",
        "Convert HTML entities to text",
        "Decode HTML entities",
        "Decode HTML entities",
        "Convert HTML entities to text",
        "HTML entity escape",
        "html entity conversion",
        "html &nbsp conversion",
        "html nbsp meaning"
    ],

    "ai.command": [
        "写一个TypeScript的HelloWorld代码",
        "检查以下内容的语法和清晰度",
        "帮助我学习词汇：为我写一个句子让我填空，我会尝试选择正确的选项",
        "改进这个Markdown内容的语法和表达，用于GitHub仓库的README",
        "你能想出一个我包的短名字吗",
        "简化这段代码",
        "帮助我学习中文",
        "如何在网页开发中让屏幕阅读器自动聚焦到新弹出的元素上",
        "总结以下文本：",
        "这段代码有什么问题吗，或者可以简化吗？",
        "生成一个打印'Hello, World!'的Python脚本",
        "你能校对这篇论文的语法和标点错误吗？",
        "为单词'serendipity'创建十个例句列表",
        "你能重新格式化这个JSON使其更易读吗？",
        "为我的关于健康饮食的博客文章建议一个有创意的标题。",
        "重构这个JavaScript函数使其更高效。",
        "帮助我练习法语：提供一个有缺失单词的句子，我可以猜。",
        "如何在模态框出现在网页上时让按钮自动聚焦",
        "为我总结这篇新闻文章",
        "你能审查这段代码片段的潜在安全漏洞吗",
        "生成一个SQL查询来查找所有在过去30天内注册的用户",
        "你能把这个段落翻译成西班牙语吗",
        "根据以下过程描述创建一个流程图。",
        "写一个计算数字阶乘的Python函数。",
        "提供如何在Web应用程序中实现OAuth2的详细解释。",
        "你能优化这张图片以便在网站上更快加载吗？",
        "为专注于健身的新移动应用建议一些吸引人的标语",
        "写一个每天备份我的文档文件夹的Bash脚本",
        "帮助我起草一封请求与潜在客户会面的电子邮件。",
        "你能把这个Markdown文档转换成HTML吗？",
        "生成一个从指定网站抓取数据的Python脚本。",
        "你能找到单词'meticulous'的同义词吗？",
        "写一个基于公共列连接两个表的SQL查询。",
        "根据以下指令集创建一个流程图。",
        "为一个新的任务管理工具建议一个名字。",
        "在不改变其功能的情况下简化这段Python代码。",
        "你能帮助我学习日语吗？",
        "如何在用户点击网页上的按钮时让警告框出现？",
        "把这个研究论文总结成要点",
        "你能检查这个算法中是否有任何逻辑错误吗？",
        "write a typescript helloworld code",
        "Check the following content for grammar and clarity",
        "Help me study vocabulary: write a sentence for me to fill in the blank, and I'll try to pick the correct option.",
        "Improve this markdown content in asepcts like grammar and expression, for a GitHub repo README.",
        "can u think of a short name of my package",
        "simplify this code",
        "help me learn chinese",
        "how to let the screen reader automatically focused to an newly poped up element in the web development",
        "summarize following text:",
        "Is there anything wrong with this code or can it be simplified?",
        "generate a Python script that prints 'Hello, World!'",
        "Can you proofread this essay for grammar and punctuation errors?",
        "Create a list of ten example sentences for the word 'serendipity.'",
        "Can you reformat this JSON to be more readable?",
        "Suggest a creative title for my blog post about healthy eating.",
        "Refactor this JavaScript function to make it more efficient.",
        "Help me practice French: provide a sentence with a missing word that I can guess.",
        "How do I make a button automatically focus when a modal appears on a webpage?",
        "Summarize this news article for me.",
        "Can you review this code snippet for potential security vulnerabilities?",
        "Generate a SQL query to find all users who signed up in the last 30 days.",
        "Can you translate this paragraph into Spanish?",
        "Create a flowchart based on the following process description.",
        "Write a Python function to calculate the factorial of a number.",
        "Provide a detailed explanation of how to implement OAuth2 in a web application.",
        "Can you optimize this image for faster loading on a website?",
        "Suggest some catchy taglines for a new mobile app focused on fitness.",
        "Write a Bash script to back up my documents folder daily.",
        "Help me draft an email to request a meeting with a potential client.",
        "Can you convert this Markdown document into HTML?",
        "Generate a Python script that scrapes data from a specified website.",
        "Can you find the synonyms of the word 'meticulous'?",
        "Write a SQL query to join two tables based on a common column.",
        "Create a flowchart based on the following set of instructions.",
        "Suggest a name for a new task management tool.",
        "Simplify this Python code without changing its functionality.",
        "Can you assist me in learning Japanese?",
        "How can I make an alert box appear when a user clicks a button on a webpage?",
        "Summarize this research paper into bullet points.",
        "Can you check if there are any logical errors in this algorithm?"
    ],

    "ai.question": [
        "你认为哪个框架最适合性能敏感的项目？",
        "什么是后量子密码学？",
        "什么是密钥派生函数",
        "什么是线性代数？",
        "线性代数在计算机科学中的主要用途是什么？",
        "我应该使用哪个IDE来编写Go语言？",
        "Go vs Java vs Kotlin，哪个适合后端",
        "哪种编程语言最适合数据分析",
        "什么是量子计算",
        "什么是哈希函数？",
        "什么是微积分？",
        "机器学习在金融中的主要应用有哪些？",
        "写Python代码最好的文本编辑器是哪个？",
        "Python vs R vs Julia，哪个更适合数据科学？",
        "监督学习和无监督学习的关键区别是什么？",
        "数据库在Web应用程序中的作用是什么",
        "什么是区块链技术",
        "使用Docker进行应用程序部署的优势是什么？",
        "哪个云服务提供商提供最好的AI工具？",
        "加密是如何工作的？",
        "负载均衡器在网络架构中的目的是什么？",
        "机器学习和深度学习有什么区别",
        "软件工程中最常见的设计模式有哪些",
        "神经网络是如何学习的",
        "使用微服务架构的主要好处是什么",
        "编译器和解释器有什么区别？",
        "Rust编程语言的关键特性是什么？",
        "HTTP和HTTPS有什么区别",
        "使用像Git这样的版本控制系统有什么优势？",
        "什么是'边缘计算'的概念",
        "哪种编程语言最适合构建移动应用？",
        "关系数据库和NoSQL数据库有什么不同？",
        "算法在计算机科学中的重要性是什么？",
        "API在软件开发中的作用是什么",
        "保护Web应用程序的最佳实践是什么",
        "虚拟现实和增强现实有什么区别？",
        "机器翻译是如何工作的？",
        "Which framework do you think is the most suitable for performance sensitive projects?",
        "What is post-quantum cryptography",
        "What is a key derivation function?",
        "What is Linear Algebra?",
        "What is the main use of linear algebra in computer science",
        "which IDE should I use for Go",
        "Go vs Java vs Koltin, which for a backend",
        "Which programming language is best suited for data analysis?",
        "What is quantum computing?",
        "What is a hash function?",
        "What is calculus?",
        "What are the main applications of machine learning in finance?",
        "Which text editor is best for writing Python code?",
        "Python vs R vs Julia, which is better for data science?",
        "What are the key differences between supervised and unsupervised learning?",
        "What is the role of a database in a web application?",
        "What is blockchain technology?",
        "What are the advantages of using Docker for application deployment?",
        "Which cloud service provider offers the best AI tools?",
        "How does encryption work?",
        "What is the purpose of a load balancer in network architecture?",
        "What is the difference between machine learning and deep learning?",
        "What are the most common design patterns in software engineering?",
        "How does a neural network learn?",
        "What is the main benefit of using a microservices architecture?",
        "What is the difference between a compiler and an interpreter?",
        "What are the key features of the Rust programming language?",
        "What is the difference between HTTP and HTTPS?",
        "What are the advantages of using a version control system like Git?",
        "What is the concept of 'edge computing'?",
        "Which programming language is best for building mobile apps?",
        "How does a relational database differ from a NoSQL database?",
        "What is the importance of algorithms in computer science?",
        "What is the role of an API in software development?",
        "What are the best practices for securing a web application?",
        "What is the difference between virtual reality and augmented reality?",
        "How does machine translation work?"
    ],
    "datetime": ["明天周几", "16天后是几号", "一年前的今天是星期几"]
}
